kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
        switch (token.type) {
            case SyntaxHighlighter::TokenType::KEYWORD:
                color = ImVec4(0.8f, 0.3f, 0.8f, 1.0f); // Purple
                break;
            case SyntaxHighlighter::TokenType::TYPE:
                color = ImVec4(0.3f, 0.8f, 0.8f, 1.0f); // Cyan
                break;
            case SyntaxHighlighter::TokenType::FUNCTION:
                color = ImVec4(0.8f, 0.8f, 0.3f, 1.0f); // Yellow
                break;
            case SyntaxHighlighter::TokenType::STRING:
                color = ImVec4(0.8f, 0.5f, 0.3f, 1.0f); // Orange
                break;
            case SyntaxHighlighter::TokenType::COMMENT:
                color = ImVec4(0.4f, 0.8f, 0.4f, 1.0f); // Green
                break;
            case SyntaxHighlighter::TokenType::NUMBER:
                color = ImVec4(0.5f, 0.8f, 1.0f, 1.0f); // Light blue
                break;
            case SyntaxHighlighter::TokenType::PREPROCESSOR:
                color = ImVec4(0.8f, 0.4f, 0.4f, 1.0f); // Red
                break;
            case SyntaxHighlighter::TokenType::OPERATOR:
            case SyntaxHighlighter::TokenType::IDENTIFIER:
            case SyntaxHighlighter::TokenType::WHITESPACE:
            default:
                color = ImVec4(0.9f, 0.9f, 0.9f, 1.0f); // Light gray
                break;
        }
        
        ImGui::TextColored(color, "%s", token.text.c_str());
        
        // Don't add newline after each token - let text flow naturally
        if (token.text.find('\n') == std::string::npos) {
            ImGui::SameLine(0, 0);
        }
    }
}

} // namespace gui
} // namespace esp32_ide
